### 5. 판다스

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [6]:
import numpy as np

#### 5.1.1 Series 
- 1차원 배열 같은 자료구조
- 색인(index) 배열의 데이터와 연관된 이름을 가지고있다.

In [10]:
# index와 value들이  각각 매겨진다.
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.index, obj.values

(RangeIndex(start=0, stop=4, step=1), array([ 4,  7, -5,  3]))

In [12]:
#따로 index를 지정해주는것도 가능하다
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

#### 사전형 데이터 저장

In [13]:
sdata = {"Ohio": 35000, "Texas": 71000, \
         "Oregon": 16000, "Utah": 5000} 
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
# 사전 객체만 가지고 Series 객체를 생성하면 Series객체의 색인에는 사전의 키값이 순서대로 들어간다.
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
# isnull, noynull을 통해 데이터 누락상태를 확인가능

pd.isnull(obj4), pd.notnull(obj4)

(California     True
 Ohio          False
 Oregon        False
 Texas         False
 dtype: bool, California    False
 Ohio           True
 Oregon         True
 Texas          True
 dtype: bool)

In [19]:
# 2개 데이터간의 합산도 가능 (obj4에는 Utah가 존재하지 않아 NaN)

obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [20]:
# column 명을 지정해줄 수 있다.
obj4.name = "population" #obj4의 이름지정
obj4.index.name = "state" #column명 지정
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [21]:
# index명 직접 지정
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.2 DataFrame

In [31]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", \
                   "Nevada", "Nevada"],\
       "year": [2000, 2001, 2002, 2001, 2002, 2003],\
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
# 이런식으로 칼럼순서 바꿀 수 있다.
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [33]:
# 없는 항목들은 NaN표기, index가 넘어가면 indicies 오류뜬다
frame2 = pd.DataFrame(data, columns = ["year", "state"\
                                       , "pop", "debt"],\
                     index = ["one", "two", "three", "four",\
                             "five", "six"])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [34]:
# 이런식으로 칼럼명을 직접 호출해서 접근 가능
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [35]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [39]:
#loc을 통해 index를 통해 접근가능
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [41]:
# column 대입도 가능하다.
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [43]:
import numpy as np
frame2['debt'] = np.arange(6.0)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [50]:
# 리스트, 배열을 컬럼에 대입할 때, 값의 길이가 DataFrame의 크기와 동일해야한다.

val = pd.Series([-1.2, -1.5, -1.7],\
                index = ["two", "four", "five"])
frame2["debt"] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
# 새로운 column명을 대입하면서 boolean값 생성가능. Ohio가 easter인지 아닌지 해보자
frame2["eastern"] = frame2.state == "Ohio"
frame2

       year   state  pop  debt  easterm  eastern
one    2000    Ohio  1.5   NaN     True     True
two    2001    Ohio  1.7  -1.2     True     True
three  2002    Ohio  3.6   NaN     True     True
four   2001  Nevada  2.4  -1.5    False    False
five   2002  Nevada  2.9  -1.7    False    False
six    2003  Nevada  3.2   NaN    False    False

In [55]:
#삭제하기
del frame2["eastern"]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [56]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [58]:
#바깥의 key값은 Column이 되고, 안쪽의 key값은 row가 된다.
pop = {"Nevada": {2001: 2.4, 2002: 2.9}, \
"Ohio": {2000: 1.5, 2001: 1.7, 2002:3.6}}

In [59]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [60]:
#뒤집기도 가능하다
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [61]:
#직접 index값을 지정해줄 수 있다.
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [64]:
#범위를 지정해주어 뽑아내는것도 가능
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [65]:
pdata = {"Ohio": frame3["Ohio"][:-1], \
         "Nevada": frame3["Nevada"][:2]}

In [66]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [71]:
pd.DataFrame(frame3, index = [2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

#### 5.1.3 색인 객체

In [72]:
obj = pd.Series(range(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int64

In [77]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [78]:
# index는 변경이 불가능하다
index[0] = "d"

TypeError: Index does not support mutable operations

In [80]:
frame3 = pd.DataFrame(frame3, index= [2000, 2001, 2002])
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [81]:
# data값 확인해보자
"Ohio"in frame3.columns, 2003 in frame3.index

(True, False)

In [82]:
# pd는 중복된 색인이 가능하고, index값을 선택하면 해당하는 모든값들 output
dup_labels = pd.Index(["foo", "foo", "bar", "bar"])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### 5.2 핵심기능

In [83]:
#### 5.2.1 재색인(reindex)

obj = pd.Series([4.5, 7.2, -5.3, 3.6], \
                index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [84]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [87]:
# 누락된 값은 `ffill` 같은 메서드를 이용해 직전의 값으로 채워넣는다.

obj3 = pd.Series(["blue", "pruple", "yellow"], \
                 index=[0,2,4])
obj3

0      blue
2    pruple
4    yellow
dtype: object

In [88]:
obj3.reindex(range(6), method="ffill")

0      blue
1      blue
2    pruple
3    pruple
4    yellow
5    yellow
dtype: object

In [90]:
#reindex는 row,column 둘다변경 가능
frame = pd.DataFrame(np.arange(9).reshape(3,3),\
                     index=["a", "c", "d"],\
                    columns = ["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [91]:
frame2 = frame.reindex(["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [93]:
# 예약어를 통해 재색인도 가능
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [94]:
#이방법은 쓰지말라네?ㅋ
frame.loc[["a", "b", "c", "d"], states]

/usr/local/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### 5.2.2 하나의 로우나 컬럼 삭제하기

In [95]:
obj = pd.Series(np.arange(5.), index = ["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [97]:
#drop을 통해 삭제한다
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [101]:
#2개이상 드랍할때 'ㅡ'
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [102]:
#DataFrame 로우, 컬럼모두 삭제가능하다. 다음 예제 봅쉬다
data = pd.DataFrame(np.arange(16).reshape(4,4), \
                    index=["Ohio","Colorado", "Utah", "New York"],\
                   columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
# column 삭제시, axis=1, 또는 axis = "columns"를 인자로 넘긴다
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [107]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [109]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
#inplace = True 하면 바로 실제 참조값까지 변경한다.
obj.drop("c", inplace=True)

In [111]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [112]:
#### 5.2.3 색인하기, 선택하기, 거르기

obj = pd.Series(np.arange(4.), index= ["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [114]:
# 이런식으로도 된다. value가 2보다 큰것
obj[obj>2]

d    3.0
dtype: float64

In [115]:
obj["b":"c"]

b    1.0
c    2.0
dtype: float64

In [116]:
#슬라이싱을 이름으로하면 시작점,끝점 모두포함, 숫자는 끝점 포함x
obj["b":"c"] = 5

In [117]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [118]:
data = pd.DataFrame(np.arange(16).reshape(4,4), \
                    index=["Ohio","Colorado", "Utah", "New York"],\
                   columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data[1:3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [123]:
#column, three가 >5보다 큰것
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### loc, iloc

In [128]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [127]:
#iloc 을 이용하여 위와 비슷하게 선택가능
# 3번 row, 4,1,2 column
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [131]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [132]:
data.loc[:"Utah", "two"]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [134]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

#### 5.2.4 정수 색인

In [137]:

ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [140]:
ser2 = pd.Series(np.arange(3.), index = ["a", "b", "c"])
ser2[-1]

2.0

#### 5.2.5  산술 연산, 데이터 정렬
- 짝이 맞지 않으면 NaN 이 되어버린다

In [3]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])

In [4]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [7]:
# DataFrame도 마찬가지이다.

df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns = list("bcd"), \
                   index = ["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns = list("bde"), \
                   index = ["Utah", "Ohio", "Texas", "Oregon"])

In [8]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [9]:
# NaN으로 처리하고 싶지 않을 시, fill_value값을 인자로 전달하면 된다.

df1 = pd.DataFrame(np.arange(12.).reshape(3,4), columns = list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape(4,5), columns=list("abcde"))
# df2의 row1, columns `b`를 nan 으로 변경
df2.loc[1, "b"] = np.nan

In [10]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [11]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [12]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
# 1 / df1 == df1.rdiv(1) 같은 효과이다(radd, rsub, rfloordiv, rmul, rpow등이 있다)
1 / df1 == df1.rdiv(1)

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True

In [15]:
#reindex도 fill_value 가능

df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### DataFrame과 Series간의 연산

In [16]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3), columns = list("bde"), \
                     index =["Utah", "Ohio", "Texas", "Oregon"])

In [24]:
series = frame.iloc[0]

#### 5.2.6 함수 적용과 매핑

In [25]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list("bde"), \
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.635509  0.546156 -0.469005
Ohio    3.043165 -0.380968  0.082613
Texas   0.717999 -0.224201 -2.000519
Oregon  0.314062 -1.133843  1.491247

In [26]:
#apply 사용해서, 각 칼럼이나 로우의 1차원 배열에 함수적용한다. 
# Column계산

f = lambda x: x.max() - x.min()

frame.apply(f)

b    4.678674
d    1.679999
e    3.491766
dtype: float64

In [27]:
# Row 계산
frame.apply(f, axis="columns")

Utah      2.181665
Ohio      3.424133
Texas     2.718518
Oregon    2.625089
dtype: float64

In [28]:
# 우와;;
def f(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

frame.apply(f)

            b         d         e
min -1.635509 -1.133843 -2.000519
max  3.043165  0.546156  1.491247

In [29]:
#실숫값을 문자열로 바꾸고싶다면 `applymap`을 이용한다.
format = lambda x: "%.2f" %x

frame.applymap(format)

            b      d      e
Utah    -1.64   0.55  -0.47
Ohio     3.04  -0.38   0.08
Texas    0.72  -0.22  -2.00
Oregon   0.31  -1.13   1.49

#### 5.2.7 정렬과 순위
- `sort_index` 메서드를 사용한다.

In [32]:
obj = pd.Series(range(4), index = list("dabc"))

In [33]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [34]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [35]:
frame = pd.DataFrame(np.arange(8).reshape(2,4), index=["three", "one"],
                    columns = list("dabc"))

In [36]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [37]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [38]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [40]:
# 값에 따라 정렬하고 싶으면 `sort_values` 를 사용

obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [41]:
#1개의 칼럼만 정렬하고 싶을때는 이름을 지정해준다.

frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame.sort_values(by="b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [42]:
#여러개는 list로 항목들을 넣어준다.
frame.sort_values(by=["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [43]:
#각 항목별 rank를 매긴다. 동점인 항목에 대해서는 평균순위를 매긴다.
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [45]:
# 나타나는 순서에 따라 순위를 매길 수 도있음.
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [46]:
# 그룹내에서 높은 순위 적용
obj.rank(ascending=False, method="max")

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [48]:
#### 5.2.8 중복 색인
obj = pd.Series(range(5), index=list("aabbc"))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [49]:
# obj.index.is_unique 는 중복되는 색인값이 없는지 보여준다.
obj.index.is_unique

False

In [50]:
df = pd.DataFrame(np.random.randn(4,3), index = list("aabb"))
df

          0         1         2
a  3.012929  1.181737 -0.104548
a  1.094494  1.138431 -1.020679
b  0.077985 -1.114439 -0.181710
b  0.843555 -0.996170  2.353420

In [51]:
df.loc["b"]

          0         1        2
b  0.077985 -1.114439 -0.18171
b  0.843555 -0.996170  2.35342

### 5.3 기술 통계 계산과 요약

In [55]:
data = {"one": [1.4, 7.1, np.nan, 0.75], "two":[np.nan, -4.5, np.nan, -1.3]}

df = pd.DataFrame(data, index=list("abcd"))
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [63]:
df.mean(axis=1, skipna=False), df.mean(axis=1, skipna=True)

(a      NaN
 b    1.300
 c      NaN
 d   -0.275
 dtype: float64, a    1.400
 b    1.300
 c      NaN
 d   -0.275
 dtype: float64)

In [64]:
#idxmin, idxmax 는 최솟값 최댓값을 가지고 있는 색인값과 같은 간접통계를 반환
df.idxmax()
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [66]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

#### 5.3.1 상관관계와 공분산

In [78]:
import sys

In [85]:
import pandas_datareader

In [89]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) \
            for ticker in ["AAPL", "IBM", "MSFT", "GOOG"]}
price = pd.DataFrame({ticker: data["Adj Close"]\
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data["Volume"]\
                      for ticker, data in all_data.items()})

In [92]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-11-06  0.000428  0.006454 -0.002769 -0.000178
2019-11-07  0.011541  0.003864  0.001388  0.013206
2019-11-08  0.002737 -0.000581  0.011784  0.001918
2019-11-11  0.007919 -0.015551  0.001028 -0.009288
2019-11-12 -0.000915  0.000886  0.006570 -0.000300

In [93]:
#corr 은 상관관계, cov 공분산을 계산한다
returns["MSFT"].corr(returns["IBM"])

0.48666418498612807

In [95]:
returns["MSFT"].cov(returns["IBM"])

9.401976959112636e-05

#### 5.3.2 유일값, 값 세기, 멤버십

In [97]:
obj = pd.Series(list("cadaabbcc"))

In [102]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [103]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64